Revit 2026 API

# FailureHandlingOptions Properties

---

The FailureHandlingOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FailureHandlingOptions Class

Autodesk.Revit.DB Namespace